In [0]:
# Name: Kshirsagar Vaishnavi Anil
# Roll No.: TCOD73
# Batch: T12

In [2]:
import pandas as pd
import numpy as np
index = pd.date_range("1/1/2000", periods=8)

In [3]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

In [4]:
s

a   -0.086528
b   -0.711500
c   -1.342835
d   -1.297275
e    2.132302
dtype: float64

In [5]:
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])
df

                   A         B         C
2000-01-01 -0.648552  0.659313 -0.099236
2000-01-02 -0.887142  0.667063  1.466192
2000-01-03  0.445046 -1.231343 -0.377259
2000-01-04  0.187401  2.075141 -1.254141
2000-01-05 -0.742831  0.669048  0.672633
2000-01-06 -0.488106  1.133684 -1.105367
2000-01-07 -2.042008  2.546807 -1.239859
2000-01-08  0.360245 -0.380727  0.112358

In [6]:
df.head()

                   A         B         C
2000-01-01 -0.648552  0.659313 -0.099236
2000-01-02 -0.887142  0.667063  1.466192
2000-01-03  0.445046 -1.231343 -0.377259
2000-01-04  0.187401  2.075141 -1.254141
2000-01-05 -0.742831  0.669048  0.672633

In [7]:
df.head(2)

                   A         B         C
2000-01-01 -0.648552  0.659313 -0.099236
2000-01-02 -0.887142  0.667063  1.466192

In [8]:
df.tail()

                   A         B         C
2000-01-04  0.187401  2.075141 -1.254141
2000-01-05 -0.742831  0.669048  0.672633
2000-01-06 -0.488106  1.133684 -1.105367
2000-01-07 -2.042008  2.546807 -1.239859
2000-01-08  0.360245 -0.380727  0.112358

In [9]:
df.tail(2)

                   A         B         C
2000-01-07 -2.042008  2.546807 -1.239859
2000-01-08  0.360245 -0.380727  0.112358

In [10]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
    }
)
df

        one       two     three
a -0.944549 -0.240045       NaN
b  0.517087 -1.841126  0.313439
c -0.396527  2.780265 -0.447179
d       NaN -1.313342 -0.506332

In [11]:
df.sub(df.iloc[2], axis="columns")

        one       two     three
a -0.548022 -3.020310       NaN
b  0.913614 -4.621391  0.760618
c  0.000000  0.000000  0.000000
d       NaN -4.093607 -0.059153

In [12]:
df.sub(df.iloc[2], axis=1)

        one       two     three
a -0.548022 -3.020310       NaN
b  0.913614 -4.621391  0.760618
c  0.000000  0.000000  0.000000
d       NaN -4.093607 -0.059153

In [17]:
df.sub(df["one"], axis=0)

   one       two     three
a  0.0  0.704504       NaN
b  0.0 -2.358213 -0.203648
c  0.0  3.176792 -0.050652
d  NaN       NaN       NaN

In [19]:
df2 = df.copy()
df2

        one       two     three
a -0.944549 -0.240045       NaN
b  0.517087 -1.841126  0.313439
c -0.396527  2.780265 -0.447179
d       NaN -1.313342 -0.506332

In [20]:
df2.loc["d", "one"] = 0.08

In [21]:
df2

        one       two     three
a -0.944549 -0.240045       NaN
b  0.517087 -1.841126  0.313439
c -0.396527  2.780265 -0.447179
d  0.080000 -1.313342 -0.506332

In [22]:
df

        one       two     three
a -0.944549 -0.240045       NaN
b  0.517087 -1.841126  0.313439
c -0.396527  2.780265 -0.447179
d       NaN -1.313342 -0.506332

In [23]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [24]:
df.lt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [25]:
df.ge(df2)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [26]:
df.ne(df2)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [27]:
(df > 0).any()

one      True
two      True
three    True
dtype: bool

In [28]:
df

        one       two     three
a -0.944549 -0.240045       NaN
b  0.517087 -1.841126  0.313439
c -0.396527  2.780265 -0.447179
d       NaN -1.313342 -0.506332

In [35]:
df.loc["d"] = df.loc["a"].copy()

In [36]:
df

        one       two     three
a -0.944549 -0.240045       NaN
b  0.517087 -1.841126  0.313439
c -0.396527  2.780265 -0.447179
d -0.944549 -0.240045       NaN

In [37]:
s = pd.Series(["a", "b", "c"], dtype=object)
s

0    a
1    b
2    c
dtype: object

In [38]:
s[0]=None

In [39]:
s

0    None
1       b
2       c
dtype: object

In [40]:
s.iloc[0] = np.nan
s

0    NaN
1      b
2      c
dtype: object

In [41]:
ser1 = pd.Series([np.nan, np.nan, 2, 3])
ser2=pd.Series([np.nan, 1, np.nan, 4])

In [42]:
ser1

0    NaN
1    NaN
2    2.0
3    3.0
dtype: float64

In [43]:
ser2

0    NaN
1    1.0
2    NaN
3    4.0
dtype: float64

In [44]:
ser1+ser2

0    NaN
1    NaN
2    NaN
3    7.0
dtype: float64

In [45]:
pd.Series([1,2,3,4,5], dtype="float64").sum()

15.0

In [46]:
ser1

0    NaN
1    NaN
2    2.0
3    3.0
dtype: float64

In [47]:
ser1.dropna() #remove null val

2    2.0
3    3.0
dtype: float64

In [48]:
ser2

0    NaN
1    1.0
2    NaN
3    4.0
dtype: float64

In [49]:
ser2.fillna(999) # replace NA by 999

0    999.0
1      1.0
2    999.0
3      4.0
dtype: float64

In [52]:
data=pd.read_csv("/home/ubuntu/Desktop/DATA.csv")

In [53]:
data

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,raisedhands,VisITedResources,AnnouncementsView,Discussion,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
0,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,15,16.0,2,20,Yes,Good,Under-7,M
1,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,20,20.0,3,25,Yes,Good,Under-7,M
2,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,10,7.0,0,30,No,Bad,Above-7,L
3,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,30,25.0,5,35,No,Bad,Above-7,L
4,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,40,50.0,12,50,No,Bad,Above-7,M
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
475,F,Jordan,Jordan,MiddleSchool,G-08,A,Chemistry,S,Father,5,NaN,5,8,No,Bad,Above-7,L
476,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,F,Father,50,NaN,14,28,No,Bad,Under-7,M
477,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,S,Father,55,NaN,25,29,No,Bad,Under-7,M
478,F,Jordan,Jordan,MiddleSchool,G-08,A,History,F,Father,30,NaN,14,57,No,Bad,Above-7,L
479,F,Jordan,Jordan,MiddleSchool,G-08,A,NaN,S,Father,35,NaN,23,62,No,Bad,Above-7,L

In [54]:
df2=pd.DataFrame(data)
df2

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,raisedhands,VisITedResources,AnnouncementsView,Discussion,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
0,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,15,16.0,2,20,Yes,Good,Under-7,M
1,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,20,20.0,3,25,Yes,Good,Under-7,M
2,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,10,7.0,0,30,No,Bad,Above-7,L
3,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,30,25.0,5,35,No,Bad,Above-7,L
4,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,40,50.0,12,50,No,Bad,Above-7,M
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
475,F,Jordan,Jordan,MiddleSchool,G-08,A,Chemistry,S,Father,5,NaN,5,8,No,Bad,Above-7,L
476,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,F,Father,50,NaN,14,28,No,Bad,Under-7,M
477,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,S,Father,55,NaN,25,29,No,Bad,Under-7,M
478,F,Jordan,Jordan,MiddleSchool,G-08,A,History,F,Father,30,NaN,14,57,No,Bad,Above-7,L
479,F,Jordan,Jordan,MiddleSchool,G-08,A,NaN,S,Father,35,NaN,23,62,No,Bad,Above-7,L

In [55]:
df2.head()

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,raisedhands,VisITedResources,AnnouncementsView,Discussion,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
0,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,15,16.0,2,20,Yes,Good,Under-7,M
1,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,20,20.0,3,25,Yes,Good,Under-7,M
2,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,10,7.0,0,30,No,Bad,Above-7,L
3,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,30,25.0,5,35,No,Bad,Above-7,L
4,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,40,50.0,12,50,No,Bad,Above-7,M

In [56]:
df2.tail()

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,raisedhands,VisITedResources,AnnouncementsView,Discussion,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
475,F,Jordan,Jordan,MiddleSchool,G-08,A,Chemistry,S,Father,5,NaN,5,8,No,Bad,Above-7,L
476,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,F,Father,50,NaN,14,28,No,Bad,Under-7,M
477,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,S,Father,55,NaN,25,29,No,Bad,Under-7,M
478,F,Jordan,Jordan,MiddleSchool,G-08,A,History,F,Father,30,NaN,14,57,No,Bad,Above-7,L
479,F,Jordan,Jordan,MiddleSchool,G-08,A,NaN,S,Father,35,NaN,23,62,No,Bad,Above-7,L